Add json for rendering image & Fix contents with added new images.
